#include "stdafx.h"
#include<iostream>
#include"BOOK.h" // Файл содержит описание класса
using namespace std;
/* Более сильное сокрытие (инкапсуляция) объектов
*/

void main(){
	setlocale(LC_ALL,"Russian"); 
	BOOK bk1("Толстой Л.Н.","Война и мир","Художественная литература",1970);
	BOOK bk2("Достоевский Ф.М.","Преступление и наказание","Молодая гвардия",1975);
	BOOK bk3("Пушкин А.С.","Стихотворения и поэмы","Минск",1980);
	BOOK bk4("Дюма А.","Три мушкетера","Кишинёв",1978);
	bk1.prnt();
	bk2.prnt();
	bk3.prnt();
	bk4.prnt();
	system("pause");
}