/*
	Последовательность S из нулей и единиц длиной L<30 зашифровать и поместить в массив D. 
	Шифровать по следующему правилу: положить D1=S1, а далее Di=1, если Si=Si-1, иначе – 0. 
	Затем по данным из D расшифровать последовательность и поместить в массив R. Следует 
	реализовать ввод исходного массива, вывод требуемого массива и подпрограмму реализации 
	работы с массивом в отдельных функциях, которые должны вызываться в функции main(). 
	Выделение памяти под массив производится динамически
*/

#include <iostream>
#include <time.h>

using namespace std;

int main() {
}