/*
	Составить программу, которая в каждой строке матрицы G(m,n), m≤10, n≤12 находит сумму элементов, 
	расположенных до максимального элемента и после максимального элемента. Если сумма не может быть
	вычислена (нет элементов до или после максимального элемента), то считать ее равной нулю. Вывести 
	исходную матрицу, располагая в одной строке элементы строки матрицы, после которых вывести номер 
	столбца максимального элемента и найденные суммы. Следует реализовать ввод исходного массива, 
	вывод требуемого массива и подпрограмму реализации работы с массивом в отдельных функциях, 
	которые должны вызываться в функции main(). Выделение памяти под матрицу производится динамически
*/

